Optimize docs
